essential/08-curl/01-foo/src/main/resources/curl/NewShopper.curl

curl -X POST -H "SOAPAction: ???" -H "Cache-Control: no-cache" -H "Postman-Token: f8658d08-40dc-d504-36e2-894e44762aa3" -d '<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Body>
        <ns1:CreateShopper xmlns:ns1="urn:WSCgdShopperService">
            <bstrRequestXML>
                <ShopperCreate IPAddress="localhost" RequestedBy="JustLikeBasketCase" PLID="1" />
            </bstrRequestXML>
        </ns1:CreateShopper>
    </soapenv:Body>
</soapenv:Envelope>' "http://shopper.test.glbt1.gdg/WSCgdShopper/WSCgdShopper.dll?Handler=Default"